internet/app/controllers/main_controller.rb

  def index
    @brands = Brand.limit(3)
    @hits = Product.all.limit(8)
---
SELECT "brands".* FROM "brands" LIMIT $1  [["LIMIT", 3]]
SELECT "products".* FROM "products" LIMIT $1  [["LIMIT", 8]]