internet/app/views/category/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  [["category_id", 2]]
SELECT 1 AS one FROM "products" WHERE "products"."category_id" = $1 LIMIT $2  [["category_id", 2], ["LIMIT", 1]]
---
      <div class="col-md-9 prdt-left">
        <%if !@category.products.empty?%>
          <div class="product-one">
              <%@category.products.each do |product|%>