app/controllers/products_controller.rb

SELECT "products"."brand_id" FROM "products" WHERE "products"."id" IN ($1, $2, $3, $4)  [["id", 40], ["id", 1], ["id", 11], ["id", 9]]
---
  def recomend_products
    return product.category.products.limit(4) if recent_products.blank?

    category_ids = recent_products.pluck(:category_id)
    categories = category_ids.group_by{|e| e}.map{|k, v| [k, v.length]}.to_h
    brand_ids = recent_products.pluck(:brand_id)
     brands = brand_ids.group_by{|e| e}.map{|k, v| [k, v.length]}.to_h

    base_products = Product.where(category_id: category_ids).or(Product.where(brand_id: brand_ids))

    validate_products = base_products.map{|product|