app/views/categories/show.html.erb

      <div class="col-md-9 prdt-left">
        <%if !@category.products.empty?%>
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  [["category_id", 5]]
SELECT 1 AS one FROM "products" WHERE "products"."category_id" = $1 LIMIT $2  [["category_id", 5], ["LIMIT", 1]]